app/models/product.rb

INSERT INTO "product_versions" ("product_id", "price_in_cents", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["product_id", 1], ["price_in_cents", 1000], ["created_at", "2024-07-16 01:22:43.829457"], ["updated_at", "2024-07-16 01:22:43.829457"]]
---
  def create_version
    version = product_versions.create!(
      price_in_cents: price_in_cents
    )